Если НЕ ЗначениеЗаполнено(Объект.СчетКт) Тогда
	Объект.СчетКт = ПланыСчетов.УБИ_ПланСчетовУУ.ПустаяСсылка();
КонецЕсли;

Если НЕ ЗначениеЗаполнено(Объект.СчетДт) Тогда
	Объект.СчетДт = ПланыСчетов.УБИ_ПланСчетовУУ.ПустаяСсылка();
КонецЕсли;
	
СписокСубконто = Новый СписокЗначений;
Для i = 1 По 3 Цикл
	СписокСубконто.Добавить(Объект["СубконтоДт"+i], "СубконтоДт");
	СписокСубконто.Добавить(Объект["СубконтоКт"+i], "СубконтоКт");
	Объект["СубконтоДт"+i] = Неопределено;
	Объект["СубконтоКт"+i] = Неопределено;
КонецЦикла;	
	
Для i = 1 По Объект.СчетДт.ВидыСубконто.Количество() Цикл
	
	Если Объект.СчетДт.ВидыСубконто[i-1].ВидСубконто = Параметры.ВидСубконтоКаналыПродаж Тогда
		Если ЗначениеЗаполнено(Объект.ДокументУУ) И НЕ ТипЗнч(Объект.ДокументУУ) = Тип("ДокументСсылка.ПлатежноеПоручениеВходящее") Тогда
			Объект["СубконтоДт"+i] = ?(ТипЗнч(Объект.ДокументУУ) = Тип("ДокументСсылка.КорректировкаДолга"), Объект.ДокументУУ.КонтрагентДебитор.КаналПродаж, ?(ТипЗнч(Объект.ДокументУУ) = Тип("ДокументСсылка.ТребованиеНакладная"), Объект.ДокументУУ.КлаймДескКонтрагент.КаналПродаж, Объект.ДокументУУ.Контрагент.КаналПродаж));
		КонецЕсли;	
	ИначеЕсли Объект.СчетДт.ВидыСубконто[i-1].ВидСубконто = Параметры.ВидСубконтоНоменклатурныеГруппы И Лев(Объект.СчетДт.Код, 2) = "91" Тогда
		Если ЗначениеЗаполнено(Объект.ДокументУУ) И ТипЗнч(Объект.ДокументУУ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Объект["СубконтоДт"+i] = Параметры.НоменклатурнаяГруппаРемонтИЗапчасти;	
		КонецЕсли;			
	ИначеЕсли Объект.СчетДт.ВидыСубконто[i-1].ВидСубконто = Параметры.ВидСубконтоПодразделения и Лев(Объект.СчетДт.Код, 2) = "91" и ЗначениеЗаполнено(Объект.ДокументУУ) Тогда
		Если ЗначениеЗаполнено(Объект.ДокументУУ) И ТипЗнч(Объект.ДокументУУ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Объект["СубконтоДт"+i] = Объект.ДокументУУ.Подразделение;
		КонецЕсли;	
	Иначе 
		Для каждого СтрокаСпискаСубконто Из СписокСубконто Цикл
			Если НЕ СтрокаСпискаСубконто.Пометка И СтрокаСпискаСубконто.Представление = "СубконтоДт" И Объект.СчетДт.ВидыСубконто[i-1].ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(СтрокаСпискаСубконто.Значение)) Тогда	
				Объект["СубконтоДт"+i] = СтрокаСпискаСубконто.Значение;
				СтрокаСпискаСубконто.Пометка = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;	
КонецЦикла;	

Для i = 1 По Объект.СчетКт.ВидыСубконто.Количество() Цикл  			 
	
	Для каждого СтрокаСпискаСубконто Из СписокСубконто Цикл
		Если НЕ СтрокаСпискаСубконто.Пометка И СтрокаСпискаСубконто.Представление = "СубконтоКт" И Объект.СчетКт.ВидыСубконто[i-1].ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(СтрокаСпискаСубконто.Значение)) Тогда	
			Объект["СубконтоКт"+i] = СтрокаСпискаСубконто.Значение;
			СтрокаСпискаСубконто.Пометка = Истина;
			Прервать;
		КонецЕсли;  					
	КонецЦикла;
	
КонецЦикла;  		

Если НЕ Найти(Объект.ДокументБУ, "Авансовый отчет") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.АвансовыйОтчет;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Восстановление НДС") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ВосстановлениеНДС;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "ГТД по импорту") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ГТДИмпорт;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Поступление на расчетный счет") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ПоступлениеНаРасчетныйСчет;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Списание с расчетного счета") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.СписаниеСРасчетногоСчета;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Поступление доп. расходов") = 0 Тогда  
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ПоступлениеДопРасходов;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Поступление товаров и услуг") = 0 Тогда
	Если Сред(Объект.ДокументБУ, 31, 1) = "В" Тогда
		Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ВозвратТоваровОтПокупателя;		
	Иначе	
		Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ПоступлениеТоваровУслуг;
	КонецЕсли;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Распределение НДС") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.РаспределениеНДС;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Реализация товаров и услуг") = 0 ИЛИ НЕ Найти(Объект.ДокументБУ, "Реализация услуг по переработке") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.РеализацияТоваровУслуг;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Корректировка поступления") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.КорректировкаПоступления;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Корректировка реализации") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.КорректировкаРеализации;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Счет-фактура выданный") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.СчетФактураВыданный;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Счет-фактура полученный") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.СчетФактураПолученный;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Формирование записей книги покупок") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ФормированиеЗаписейКнигиПокупок;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Формирование записей книги продаж") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ФормированиеЗаписейКнигиПродаж;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Отражение НДС к вычету") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ОтражениеНДСКВычету;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Отражение начисления НДС") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ОтражениеНачисленияНДС;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Поступление из переработки") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ПоступлениеИзПереработки;
	Объект.СубконтоДт2 = Справочники.УБИ_ПотерянныеДокументыИзБУ.НайтиПоРеквизиту("ДокументБУ", Объект.ДокументБУ);
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Передача ОС") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ПередачаОС;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Списание НДС") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.СписаниеНДС;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Списание товаров") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.СписаниеТоваров;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Возврат товаров от покупателя") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ВозвратТоваровОтПокупателя;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Начисление НДС по СМР") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.НачислениеНДСпоСМРхозспособом;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Корректировка долга") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.КорректировкаДолга;
ИначеЕсли НЕ Найти(Объект.ДокументБУ, "Требование-накладная") = 0 Тогда
	Объект.ВидОперации = Перечисления.УБИ_ВидыОперацийНДСпоУправленческомуБалансу.ТребованиеНакладная;
КонецЕсли;