	Если СсылкаНаОбъект.ТипОбъекта = "Поступление из переработки" Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ПоступлениеТоваровУслуг.Ссылка
		                      |ИЗ
		                      |	Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		                      |ГДЕ
		                      |	НАЧАЛОПЕРИОДА(ПоступлениеТоваровУслуг.Дата, ГОД) = &Дата
		                      |	И ПоступлениеТоваровУслуг.ВидОперации = &ВидОперации
		                      |	И ПоступлениеТоваровУслуг.СуммаДокумента = &СуммаДокумента
		                      |	И ПоступлениеТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента");
		Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийПоступлениеТоваровУслуг.ПоступлениеИзПереработки);
		Запрос.УстановитьПараметр("СуммаДокумента", СвойстваПоиска["СуммаДокумента"]);
		Запрос.УстановитьПараметр("ДоговорКонтрагента", СвойстваПоиска["ДоговорКонтрагента"]);
	Иначе	
		лТипДокумента = СтрЗаменить(СсылкаНаОбъект.ТипОбъекта, " ", "");
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	ДокументыПоиска.Ссылка
		                      |ИЗ
		                      |	Документ."+лТипДокумента+" КАК ДокументыПоиска
		                      |ГДЕ
		                      |	ДокументыПоиска.Номер = &Номер
		                      |	И НАЧАЛОПЕРИОДА(ДокументыПоиска.Дата, ГОД) = &Дата");
		Запрос.УстановитьПараметр("Номер", СсылкаНаОбъект.Номер);
	КонецЕсли;	
	Запрос.УстановитьПараметр("Дата", НачалоГода(СсылкаНаОбъект.Дата));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ТекОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		ТекОбъект.ДокументАналогВУТ = Выборка.Ссылка;
		ТекОбъект.Записать();
	КонецЕсли;