Если НомерВариантаПоиска = 1 И Сред(СокрЛП(СвойстваПоиска["Номер"]), 3, 1) = "В" Тогда
	лДокументБУ = ""+СтрЗаменить(ТипОбъекта, "Документ ссылка: ", "")+" "+СвойстваПоиска["Номер"]+" от "+СвойстваПоиска["Дата"];
	СвойстваПоиска["Номер"] = Лев(СокрЛП(СвойстваПоиска["Номер"]), 2) + "0" + Прав(СокрЛП(СвойстваПоиска["Номер"]), 8);
	ТипОбъекта = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя");
	Выполнить(Алгоритмы.ПоискВ_УБИ_ПотерянныеДокументыИзБУ);
ИначеЕсли НомерВариантаПоиска = 2 Тогда
	лДокументБУ = ""+СтрЗаменить(ТипОбъекта, "Документ ссылка: ", "")+" "+СвойстваПоиска["Номер"]+" от "+СвойстваПоиска["Дата"];
	Выполнить(Алгоритмы.ПоискВ_УБИ_ПотерянныеДокументыИзБУ);
КонецЕсли;