
лДокументБУ = ?(ТипОбъекта = Тип("СправочникСсылка.УБИ_ПотерянныеДокументыИзБУ"), СвойстваПоиска["Наименование"], лДокументБУ);			  
СсылкаНаОбъект = Справочники.УБИ_ПотерянныеДокументыИзБУ.НайтиПоРеквизиту("УникальныйИдентификатор", СвойствоУникальныйИдентификатор);
Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
	Если СсылкаНаОбъект.Дата <> СвойстваПоиска["Дата"] ИЛИ СсылкаНаОбъект.Номер <> СвойстваПоиска["Номер"] ИЛИ СсылкаНаОбъект.ДокументБУ <> лДокументБУ Тогда
		ТекОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		ТекОбъект.Дата = СвойстваПоиска["Дата"];
		ТекОбъект.Номер = СвойстваПоиска["Номер"];
		//ТекОбъект.ТипОбъекта = ?(СвойстваПоиска["ТипОбъекта"] = Неопределено, СтрЗаменить(ТипОбъекта, "Документ ссылка: ", ""), СвойстваПоиска["ТипОбъекта"]);
		ТекОбъект.Наименование = лДокументБУ;
		ТекОбъект.ДокументБУ = лДокументБУ;
		ТекОбъект.Записать(); 		
	КонецЕсли;	
	Если (ТипОбъекта = "Поступление из переработки" И НЕ ТипОбъекта = СсылкаНаОбъект.ТипОбъекта) Тогда
		ТекОбъект = СсылкаНаОбъект.ПолучитьОбъект();
		ТекОбъект.ТипОбъекта = "Поступление из переработки"; 		
		ТекОбъект.Записать();  		
	КонецЕсли;   		
Иначе
	НовыйЭлемент = Справочники.УБИ_ПотерянныеДокументыИзБУ.СоздатьЭлемент();	
	НовыйЭлемент.УникальныйИдентификатор = СвойствоУникальныйИдентификатор;
	НовыйЭлемент.Дата = СвойстваПоиска["Дата"];
	НовыйЭлемент.Номер = СвойстваПоиска["Номер"];
	НовыйЭлемент.ТипОбъекта = ?(СвойстваПоиска["ТипОбъекта"] = Неопределено, СтрЗаменить(ТипОбъекта, "Документ ссылка: ", ""), СвойстваПоиска["ТипОбъекта"]);
	НовыйЭлемент.Наименование = лДокументБУ;
	НовыйЭлемент.ДокументБУ = лДокументБУ;
	НовыйЭлемент.Записать();
	СсылкаНаОбъект = НовыйЭлемент.Ссылка; 
КонецЕсли;

Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект.ДокументАналогВУТ) 
	И (ТипОбъекта = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") 
	ИЛИ СсылкаНаОбъект.ТипОбъекта = "Поступление из переработки") Тогда
	
	Выполнить(Алгоритмы.НайтиДокументАналогВУТ);
	
КонецЕсли;