//НаборСоответствийСубконто = РегистрыСведений.УБИ_СоответствиеСубконтоБУиУУ.СоздатьНаборЗаписей();
//НаборСоответствийСубконто.Прочитать();
//Параметры.Вставить("НаборСоответствийСубконто", НаборСоответствийСубконто.Выгрузить());

Параметры.Вставить("ВидСубконтоКаналыПродаж", ПланыВидовХарактеристик.УБИ_ВидыСубконто.НайтиПоНаименованию("Каналы продаж"));
Параметры.Вставить("ВидСубконтоНоменклатурныеГруппы", ПланыВидовХарактеристик.УБИ_ВидыСубконто.НайтиПоНаименованию("Номенклатурные группы"));
Параметры.Вставить("ВидСубконтоПодразделения", ПланыВидовХарактеристик.УБИ_ВидыСубконто.Подразделения);
Параметры.Вставить("НоменклатурнаяГруппаРемонтИЗапчасти", Справочники.НоменклатурныеГруппы.НайтиПоКоду("000000014"));