Запрос = Новый Запрос;

Запрос.Текст = 
"ВЫБРАТЬ РАЗЛИЧНЫЕ
|	Обороты.Дата КАК Дата,
|	ПРЕДСТАВЛЕНИЕ(Обороты.Регистратор) КАК ДокументБУ,
|	Обороты.Регистратор КАК ДокументУУ,
//|	Обороты.Организация КАК Организация,
|	Обороты.Регистратор.ДоговорКонтрагента КАК ДоговорКонтрагента,
|	Обороты.СчетДт КАК СчетДт,
|	Обороты.СубконтоДт1 КАК СубконтоДт1,
|	Обороты.СубконтоДт2 КАК СубконтоДт2,
|	Обороты.СубконтоДт3 КАК СубконтоДт3,
|	Обороты.СчетКт КАК СчетКт,
|	Обороты.СубконтоКт1 КАК СубконтоКт1,
|	Обороты.СубконтоКт2 КАК СубконтоКт2,
|	Обороты.СубконтоКт3 КАК СубконтоКт3,
|	Обороты.Сумма КАК Сумма,
|	НЕОПРЕДЕЛЕНО КАК Содержание
|ИЗ
|	(ВЫБРАТЬ
|		ОборотыДт.Регистратор.Дата КАК Дата,
|		ОборотыДт.Регистратор КАК Регистратор,
|		ОборотыДт.СчетДт КАК СчетДт,
|		ОборотыДт.СубконтоДт1 КАК СубконтоДт1,
|		ОборотыДт.СубконтоДт2 КАК СубконтоДт2,
|		ОборотыДт.СубконтоДт3 КАК СубконтоДт3,
|		ОборотыДт.СчетКт КАК СчетКт,
|		ОборотыДт.СубконтоКт1 КАК СубконтоКт1,
|		ОборотыДт.СубконтоКт2 КАК СубконтоКт2,
|		ОборотыДт.СубконтоКт3 КАК СубконтоКт3,
|		СУММА(ОборотыДт.СуммаОборот) КАК Сумма
|	ИЗ
|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
|				&парНачалоПериода,
|				&парКонецПериода,
|				Регистратор,
|				СчетДт В ИЕРАРХИИ (&парСчет19)
|					ИЛИ СчетДт = &Счет6802 ИЛИ СчетДт = &Счет6832,
|				,
|				(НЕ СчетКт В ИЕРАРХИИ (&парСписокСчетов)),
|				,
|				Организация = &Организация) КАК ОборотыДт
|	
|	СГРУППИРОВАТЬ ПО
|		КОНЕЦПЕРИОДА(ОборотыДт.Период, ДЕНЬ),
|		ОборотыДт.Регистратор,
|		ОборотыДт.СчетДт,
|		ОборотыДт.СубконтоДт1,
|		ОборотыДт.СубконтоДт2,
|		ОборотыДт.СубконтоДт3,
|		ОборотыДт.СчетКт,
|		ОборотыДт.СубконтоКт2,
|		ОборотыДт.СубконтоКт3,
|		ОборотыДт.СубконтоКт1,
|		ОборотыДт.Регистратор.Дата
|	
|	ОБЪЕДИНИТЬ ВСЕ
|	
|	ВЫБРАТЬ
|		ОборотыКт.Регистратор.Дата,
|		ОборотыКт.Регистратор,
|		ОборотыКт.СчетДт,
|		ОборотыКт.СубконтоДт1,
|		ОборотыКт.СубконтоДт2,
|		ОборотыКт.СубконтоДт3,
|		ОборотыКт.СчетКт,
|		ОборотыКт.СубконтоКт1,
|		ОборотыКт.СубконтоКт2,
|		ОборотыКт.СубконтоКт3,
|		СУММА(ОборотыКт.СуммаОборот)
|	ИЗ
|		РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(
|				&парНачалоПериода,
|				&парКонецПериода,
|				Регистратор,
|				,
|				,
|				СчетКт В ИЕРАРХИИ (&парСчет19)
|					ИЛИ СчетКт = &Счет6802 ИЛИ СчетКт = &Счет6832,
|				,
|				Организация = &Организация) КАК ОборотыКт
|	
|	СГРУППИРОВАТЬ ПО
|		ОборотыКт.СубконтоКт3,
|		КОНЕЦПЕРИОДА(ОборотыКт.Период, ДЕНЬ),
|		ОборотыКт.СубконтоДт1,
|		ОборотыКт.СчетДт,
|		ОборотыКт.Регистратор,
|		ОборотыКт.СубконтоДт2,
|		ОборотыКт.СубконтоДт3,
|		ОборотыКт.СчетКт,
|		ОборотыКт.СубконтоКт2,
|		ОборотыКт.СубконтоКт1,
|		ОборотыКт.Регистратор.Дата) КАК Обороты
|//ДопУсловие
|УПОРЯДОЧИТЬ ПО
|	Дата";
			   
Запрос.УстановитьПараметр("парСчет19",	ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымЦенностям);
Запрос.УстановитьПараметр("Счет6802",	ПланыСчетов.Хозрасчетный.НДС);
Запрос.УстановитьПараметр("Счет6832",	ПланыСчетов.Хозрасчетный.НДСНалоговогоАгента);
Запрос.УстановитьПараметр("парСписокСчетов", Новый Массив);
Запрос.УстановитьПараметр("парНачалоПериода", Новый Граница(НачалоДня(ДатаНачала), ВидГраницы.Включая));
Запрос.УстановитьПараметр("парКонецПериода", Новый Граница(КонецДня(ДатаОкончания), ВидГраницы.Включая));
Запрос.УстановитьПараметр("Организация", Параметры.Организация);

Если ЗначениеЗаполнено(Параметры.ДопУсловие) Тогда
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ДопУсловие", Параметры.ДопУсловие); 
КонецЕсли;

ВыборкаДанных = Запрос.Выполнить().Выгрузить();

Для Каждого СтрокаПроводки из ВыборкаДанных Цикл
	//СтрокаПроводки.ДокументБУ = СтрЗаменить(СтрокаПроводки.ДокументБУ, "Реализация (акт, накладная)", "Реализация товаров и услуг");
	СтрокаПроводки.ДокументБУ = СтрЗаменить(СтрокаПроводки.ДокументБУ, "Реализация (акт, накладная, УПД)", "Реализация товаров и услуг");
	//СтрокаПроводки.ДокументБУ = СтрЗаменить(СтрокаПроводки.ДокументБУ, "Поступление (акт, накладная)", "Поступление товаров и услуг");
	СтрокаПроводки.ДокументБУ = СтрЗаменить(СтрокаПроводки.ДокументБУ, "Поступление (акт, накладная, УПД)", "Поступление товаров и услуг");
	СтрокаПроводки.ДокументБУ = СтрЗаменить(СтрокаПроводки.ДокументБУ, "Расход материалов", "Требование-накладная");
	СтрокаПроводки.Содержание = "СчетДт: " + СтрокаПроводки.СчетДт + " " + СтрокаПроводки.СубконтоДт1 + "/" + СтрокаПроводки.СубконтоДт2 + "/" + СтрокаПроводки.СубконтоДт3 + " СчетКт: " + СтрокаПроводки.СчетКт + " " + СтрокаПроводки.СубконтоКт1 + "/" + СтрокаПроводки.СубконтоКт2 + "/" + СтрокаПроводки.СубконтоКт3 + " СУММА " + СтрокаПроводки.Сумма;
КонецЦикла;